Tekla Open API Reference for Tekla Structures 2025
ProfileItemCrossSection.ProfileItemUserParameters Property
 Gets or sets a value of the property ProfileItemUserParameters.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IList<ProfileItemParameter> ProfileItemUserParameters { get; set; }
Public Property ProfileItemUserParameters As IList(Of ProfileItemParameter)
	Get
	Set
Property Value
Type: IList<ProfileItemParameter>
See Also
Reference
ProfileItemCrossSection Class
Tekla.Structures.Catalogs Namespace